app/controllers/pages_controller.rb

  def index
    @pages = Page.all
---
SELECT "pages".* FROM "pages"

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("content", "created_at", "name", "permalink", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "This is my first post!"], ["created_at", Tue, 28 Jun 2011 16:36:21 UTC +00:00], ["name", "My first post"], ["permalink", "first"], ["updated_at", Tue, 28 Jun 2011 16:36:21 UTC +00:00]]

  def update
    @page = Page.find(params[:id])

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
UPDATE "pages" SET "content" = 'Hello **world**!', "updated_at" = '2011-06-28 22:51:07.743289' WHERE "pages"."id" = 2